# classes/weapon.py

class Weapon:
    """
    Базовий клас для опису зброї типу Автомат.
    """

    def __init__(self, model, caliber, range_effective):
        """
        Ініціалізація основних параметрів зброї.

        :param model: модель зброї (str) — назва чи тип зброї.
        :param caliber: калібр (float) — діаметр кулі у міліметрах чи дюймах.
        :param range_effective: ефективна дальність (int) — максимальна відстань у метрах для точного ураження.
        """
        # Зберігає модель зброї, наприклад, "АК-47".
        self.model = model
        # Зберігає калібр зброї, наприклад, 7.62 мм.
        self.caliber = caliber
        # Зберігає ефективну дальність, наприклад, 350 м.
        self.range_effective = range_effective

    def shoot(self):
        """
        Симуляція пострілу.

        :return: Рядок, що описує постріл із зазначенням калібру.
        """
        # Генерує текст, що описує постріл для даної моделі та калібру.
        return f"{self.model} стріляє з калібру {self.caliber}."

    def __str__(self):
        """
        Повертає інформацію про зброю.

        :return: Рядок, що містить опис моделі, калібру та дальності.
        """
        # Форматує текст для зручного відображення інформації про об'єкт.
        return f"Модель: {self.model}, Калібр: {self.caliber}, Дальність: {self.range_effective} м"
