# main.py

# Імпортуємо базовий клас "Weapon" (зброя)
from Classes.weapon import Weapon
# Імпортуємо похідний клас "AssaultRifle" (штурмова гвинтівка)
from Classes.assault_rifle import AssaultRifle

def main():
    """
    Основна функція для демонстрації роботи базового та похідного класів.
    """
    # Створення екземпляра базового класу "Зброя" з параметрами: назва, калібр, дальність
    ak47 = Weapon("АК-47", 7.62, 350)
    # Виводимо інформацію про зброю
    print(ak47)
    # Викликаємо метод стрільби для базового класу
    print(ak47.shoot())

    # Створення екземпляра похідного класу "Штурмова гвинтівка" з додатковим параметром "режим стрільби"
    m4a1 = AssaultRifle("M4A1", 5.56, 500, "автоматичний")
    # Виводимо інформацію про штурмову гвинтівку
    print(m4a1)
    # Викликаємо метод стрільби для похідного класу
    print(m4a1.shoot())

    # Змінюємо режим стрільби за допомогою методу похідного класу
    print(m4a1.change_mode("одиночний"))
    # Виводимо оновлену інформацію про гвинтівку після зміни режиму
    print(m4a1)

# Перевіряємо, чи модуль запускається як основний
if __name__ == "__main__":
    main()
